/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------- 
 * @Files:DWT.c/h
 * 
 * @Author: Ye Jinyi
 * 
 * @First  Edit Date: 2014.12.2
 * @Latest Edit Date: 2014.12.2
 * 
 * @illustrate: DWT（Data Watchpoint and Trace）是ARM Cortex-M系列内核中的一个调试功能模块
 *              DWT的周期计数器记录从DWT开启以来的时钟周期数，可用于精确测量代码执行时间
 *              时钟周期数之差除以系统频率即为代码运行秒数
 * 
 * @attention: DWT->CYCCNT会溢出，所以差值数可能是不正确时间，但概率小影响小，多测几次就好
 * 
 *-------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/* Including Files  ------------------------------------------------------------------------------------------------------------------------------------------------- */
#include "DWT.h"

/* External Variables Declarations ---------------------------------------------------------------------------------------------------------------------------------- */


/* Define Exported Variables ---------------------------------------------------------------------------------------------------------------------------------------- */


/* Define Privated Variables ---------------------------------------------------------------------------------------------------------------------------------------- */


/* Define Privated Functions ---------------------------------------------------------------------------------------------------------------------------------------- */


/* Define Exported Functions ---------------------------------------------------------------------------------------------------------------------------------------- */
/*!
 * @usage: 开启DWT模块
 */
void DWT_Init(void)
{
    if (!(CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk))
    {
        CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk; // 启用跟踪功能
    }
    
    DWT->CYCCNT = 0;                        // 清零周期计数器
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;    // 启用周期计数器
}

/*!
 * @usage: 获得时钟周期数
 */
uint32_t DWT_GetCycleCount(void)
{
    return DWT->CYCCNT;
}
